lkolbly/cmsis-svd/data/Huada/HDSC_HC32F120F6TA.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CTC</name>
            <description>desc CTC</description>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F00F7</resetMask>
                    <fields>
                        <field>
                            <name>REFPSC</name>
                            <description>desc REFPSC</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REFCKS</name>
                            <description>desc REFCKS</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>desc ERRIE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTCEN</name>
                            <description>desc CTCEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRMVAL</name>
                            <description>desc TRMVAL</description>
                            <msb>21</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF00FF</resetMask>
                    <fields>
                        <field>
                            <name>OFSVAL</name>
                            <description>desc OFSVAL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RLDVAL</name>
                            <description>desc RLDVAL</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>TRIMOK</name>
                            <description>desc TRIMOK</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRMOVF</name>
                            <description>desc TRMOVF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TRMUDF</name>
                            <description>desc TRMUDF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CTCBSY</name>
                            <description>desc CTCBSY</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DBGC</name>
            <description>desc DBGC</description>
            <baseAddress>0x40015000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8</size>
            </addressBlock>
            <registers>
                <register>
                    <name>MCUDBGSTAT</name>
                    <description>desc MCUDBGSTAT</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CDBGPWRUPREQ</name>
                            <description>desc CDBGPWRUPREQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CDBGPWRUPACK</name>
                            <description>desc CDBGPWRUPACK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUSTPCTL</name>
                    <description>desc MCUSTPCTL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFF92400D</resetMask>
                    <fields>
                        <field>
                            <name>SWDTSTP</name>
                            <description>desc SWDTSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCSTP</name>
                            <description>desc RTCSTP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDSTP</name>
                            <description>desc PVDSTP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR01STP</name>
                            <description>desc TMR01STP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR21STP</name>
                            <description>desc TMR21STP</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR41STP</name>
                            <description>desc TMR41STP</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA1STP</name>
                            <description>desc TMRA1STP</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB1STP</name>
                            <description>desc TMRB1STP</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB2STP</name>
                            <description>desc TMRB2STP</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB3STP</name>
                            <description>desc TMRB3STP</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB4STP</name>
                            <description>desc TMRB4STP</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB5STP</name>
                            <description>desc TMRB5STP</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB6STP</name>
                            <description>desc TMRB6STP</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB7STP</name>
                            <description>desc TMRB7STP</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRB8STP</name>
                            <description>desc TMRB8STP</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
